tap "anomalyco/tap"                           # Tap for opencode formula

# Core dev tools
brew "git"                                    # Distributed version control system
brew "git-lfs"                                # Git extension for versioning large files
brew "git-delta"                              # Better git diffs with syntax highlighting
brew "gh"                                     # GitHub command-line tool
brew "fzf"                                    # Command-line fuzzy finder
brew "ripgrep"                                # Fast regex search tool (used by editors)
brew "fd"                                     # Fast, user-friendly alternative to find
brew "jq"                                     # Lightweight JSON processor
brew "bat"                                    # Cat clone with syntax highlighting and git integration
brew "eza"                                    # Modern replacement for ls
brew "zoxide"                                 # Smarter cd that learns your habits
brew "btop"                                   # Terminal-based resource monitor (CPU, RAM, disk, network)

# AI
brew "ollama"                                 # Run large language models locally
brew "anomalyco/tap/opencode"                 # AI coding agent for the terminal

# Utilities
brew "dockutil"                               # Manage macOS Dock items from the command line
brew "shellcheck"                             # Static analysis tool for shell scripts
brew "tree"                                   # Display directory structure as a tree

# Apps
cask "claude-code"                            # Anthropic's Claude AI terminal assistant
cask "cursor"                                 # AI-powered code editor (VS Code fork)
cask "figma"                                  # Collaborative UI design tool
cask "gcloud-cli"                             # Google Cloud SDK (gcloud, gsutil, bq)
cask "ghostty"                                # GPU-accelerated terminal emulator
cask "google-chrome"                          # Web browser
cask "slack"                                  # Team messaging and collaboration
cask "spotify"                                # Music streaming
cask "visual-studio-code"                     # Code editor

# VS Code extensions
vscode "aaron-bond.better-comments"           # Color-coded comment annotations (TODO, FIXME, etc.)
vscode "anthropic.claude-code"                # Claude Code integration for VS Code
vscode "blackblackcat.dracula-pure"           # Dracula Pure color theme variant
vscode "bradlc.vscode-tailwindcss"            # Tailwind CSS IntelliSense
vscode "chakrounanas.turbo-console-log"       # Quick console.log insertion with keybinding
vscode "christian-kohler.path-intellisense"   # Autocomplete for file paths
vscode "dbaeumer.vscode-eslint"               # ESLint integration
vscode "dracula-theme.theme-dracula"          # Dracula color theme
vscode "eamodio.gitlens"                      # Advanced Git integration (blame, history, graph)
vscode "ecmel.vscode-html-css"                # HTML/CSS class name completion
vscode "esbenp.prettier-vscode"               # Prettier code formatter
vscode "figma.figma-vscode-extension"         # Figma design integration
vscode "firsttris.vscode-jest-runner"         # Run/debug Jest tests from editor
vscode "github.copilot-chat"                  # GitHub Copilot Chat
vscode "github.vscode-github-actions"         # GitHub Actions workflow editor
vscode "github.vscode-pull-request-github"    # GitHub PR and issue management
vscode "johnpapa.winteriscoming"              # Winter is Coming color theme
vscode "mhutchie.git-graph"                   # Visual Git commit graph
vscode "naumovs.color-highlight"              # Highlight CSS color values inline
vscode "oxc.oxc-vscode"                       # Oxc linter (fast Rust-based JS/TS linter)
vscode "steoates.autoimport"                  # Auto-import for TypeScript/JavaScript
vscode "stylelint.vscode-stylelint"           # Stylelint CSS/SCSS linter
vscode "vscode-icons-team.vscode-icons"       # File icon theme
vscode "waderyan.gitblame"                    # Inline Git blame annotations
vscode "wallabyjs.quokka-vscode"              # Live JavaScript/TypeScript scratchpad
