aaron-bond.better-comments
alefragnani.bookmarks
blackblackcat.dracula-pure
chakrounanas.turbo-console-log
christian-kohler.path-intellisense
dbaeumer.vscode-eslint
dracula-theme.theme-dracula
eamodio.gitlens
ecmel.vscode-html-css
esbenp.prettier-vscode
firsttris.vscode-jest-runner
github.copilot
github.copilot-chat
github.vscode-github-actions
github.vscode-pull-request-github
johnpapa.winteriscoming
mhutchie.git-graph
naumovs.color-highlight
oxc.oxc-vscode
steoates.autoimport
stylelint.vscode-stylelint
vitest.explorer
vscode-icons-team.vscode-icons
waderyan.gitblame
wallabyjs.quokka-vscode
